{"config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "function_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image4\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null]}, "class_name": "Lambda"}, {"config": {"batch_input_shape": [null, 64, 64, 3], "activation": "linear", "nb_col": 3, "trainable": true, "name": "convolution2d_1", "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "input_dtype": "float32", "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "bias": true, "init": "normal", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 31, 31, 32], "activation": "linear", "nb_col": 3, "trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "input_dtype": "float32", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "bias": true, "init": "normal", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 15, 15, 64], "activation": "linear", "nb_col": 3, "trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "input_dtype": "float32", "nb_filter": 128, "b_regularizer": null, "border_mode": "valid", "bias": true, "init": "normal", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 7, 7, 128], "input_dtype": "float32", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 0.0003000000142492354, "name": "L1L2Regularizer"}, "trainable": true, "name": "dense_1", "bias": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 500, "init": "normal", "input_dim": 6272}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "trainable": true, "name": "dense_2", "bias": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 50, "init": "normal", "input_dim": 500}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "trainable": true, "name": "dense_3", "bias": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "init": "normal", "input_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "trainable": true, "name": "dense_4", "bias": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "init": "normal", "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}