{"config": [{"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image4\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "batch_input_shape": [null, 64, 64, 3], "trainable": true, "name": "lambda_1", "output_shape": null, "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"input_dtype": "float32", "activation": "linear", "name": "convolution2d_1", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "border_mode": "valid", "init": "normal", "nb_filter": 24, "W_constraint": null, "batch_input_shape": [null, 64, 64, 3], "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dtype": "float32", "activation": "linear", "name": "convolution2d_2", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "border_mode": "valid", "init": "normal", "nb_filter": 48, "W_constraint": null, "batch_input_shape": [null, 31, 31, 24], "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dtype": "float32", "activation": "linear", "name": "convolution2d_3", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "border_mode": "valid", "init": "normal", "nb_filter": 96, "W_constraint": null, "batch_input_shape": [null, 15, 15, 96], "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "input_dtype": "float32", "batch_input_shape": [null, 7, 7, 96], "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "output_dim": 500, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0003000000142492354, "l1": 0.0}, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": 4704, "init": "normal", "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": 500, "init": "normal", "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 10, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": 50, "init": "normal", "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 1, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "bias": true, "input_dim": 10, "init": "normal", "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}