{"config": [{"config": {"output_shape": null, "arguments": {}, "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image2\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_col": 5, "input_dtype": "float32", "name": "convolution2d_1", "nb_filter": 24, "init": "normal", "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_col": 5, "input_dtype": "float32", "name": "convolution2d_2", "nb_filter": 36, "init": "normal", "W_constraint": null, "batch_input_shape": [null, 38, 78, 24], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_col": 5, "input_dtype": "float32", "name": "convolution2d_3", "nb_filter": 48, "init": "normal", "W_constraint": null, "batch_input_shape": [null, 17, 37, 36], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_col": 3, "input_dtype": "float32", "name": "convolution2d_4", "nb_filter": 64, "init": "normal", "W_constraint": null, "batch_input_shape": [null, 7, 17, 48], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "nb_col": 3, "input_dtype": "float32", "name": "convolution2d_5", "nb_filter": 64, "init": "normal", "W_constraint": null, "batch_input_shape": [null, 5, 15, 64], "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "trainable": true, "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_1", "init": "normal", "W_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 100, "b_constraint": null, "input_dim": 2496, "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_2", "init": "normal", "W_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 50, "b_constraint": null, "input_dim": 100, "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_3", "init": "normal", "W_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 10, "b_constraint": null, "input_dim": 50, "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_4", "init": "normal", "W_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "output_dim": 1, "b_constraint": null, "input_dim": 10, "activation": "linear", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}