{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image5\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "output_shape": null, "batch_input_shape": [null, 80, 160, 3], "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "subsample": [2, 2], "name": "convolution2d_1", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_filter": 24, "nb_row": 5, "border_mode": "valid", "activation": "linear", "W_constraint": null, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 38, 78, 24], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "subsample": [2, 2], "name": "convolution2d_2", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "nb_row": 5, "border_mode": "valid", "activation": "linear", "W_constraint": null, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 17, 37, 36], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "subsample": [2, 2], "name": "convolution2d_3", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "nb_row": 5, "border_mode": "valid", "activation": "linear", "W_constraint": null, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 7, 17, 48], "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "bias": true, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "subsample": [1, 1], "name": "convolution2d_4", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "activation": "linear", "W_constraint": null, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 5, 15, 64], "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "bias": true, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "subsample": [1, 1], "name": "convolution2d_5", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "nb_row": 3, "border_mode": "valid", "activation": "linear", "W_constraint": null, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 2496, "activity_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "bias": true, "b_constraint": null, "name": "dense_1", "trainable": true, "activation": "linear", "output_dim": 200, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 200, "activity_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "bias": true, "b_constraint": null, "name": "dense_2", "trainable": true, "activation": "linear", "output_dim": 50, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 50, "activity_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "bias": true, "b_constraint": null, "name": "dense_3", "trainable": true, "activation": "linear", "output_dim": 10, "init": "normal", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 10, "activity_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "bias": true, "b_constraint": null, "name": "dense_4", "trainable": true, "activation": "linear", "output_dim": 1, "init": "normal", "b_regularizer": null}}], "keras_version": "1.2.1"}