{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image6\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "batch_input_shape": [null, 80, 160, 3], "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "batch_input_shape": [null, 80, 160, 3], "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "nb_row": 5, "bias": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 5, "input_dtype": "float32", "activation": "linear", "name": "convolution2d_1", "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "batch_input_shape": [null, 38, 78, 24], "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "nb_row": 5, "bias": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 5, "input_dtype": "float32", "activation": "linear", "name": "convolution2d_2", "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "batch_input_shape": [null, 17, 37, 36], "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "nb_row": 5, "bias": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 5, "input_dtype": "float32", "activation": "linear", "name": "convolution2d_3", "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "batch_input_shape": [null, 7, 17, 48], "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "nb_row": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "input_dtype": "float32", "activation": "linear", "name": "convolution2d_4", "trainable": true, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "batch_input_shape": [null, 5, 15, 64], "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "nb_row": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "input_dtype": "float32", "activation": "linear", "name": "convolution2d_5", "trainable": true, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "normal", "output_dim": 250, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.00019999999494757503}, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 2496, "name": "dense_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "normal", "output_dim": 50, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 250, "name": "dense_2", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "normal", "output_dim": 10, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 50, "name": "dense_3", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "init": "normal", "output_dim": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "bias": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": 10, "name": "dense_4", "trainable": true}}]}