{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 80, 160, 3], "arguments": {}, "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image5\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null]}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_filter": 24, "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "name": "convolution2d_1", "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_filter": 36, "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 38, 78, 24], "name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_filter": 48, "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 17, 37, 36], "name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_filter": 64, "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 7, 17, 48], "name": "convolution2d_4", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_filter": 64, "activation": "linear", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 5, 15, 64], "name": "convolution2d_5", "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"input_dtype": "float32", "name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "init": "normal", "trainable": true, "name": "dense_1", "activity_regularizer": null, "output_dim": 200, "input_dim": 2496, "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "init": "normal", "trainable": true, "name": "dense_2", "activity_regularizer": null, "output_dim": 50, "input_dim": 200, "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "init": "normal", "trainable": true, "name": "dense_3", "activity_regularizer": null, "output_dim": 10, "input_dim": 50, "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "init": "normal", "trainable": true, "name": "dense_4", "activity_regularizer": null, "output_dim": 1, "input_dim": 10, "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}]}