{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 24, "trainable": true, "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 80, 160, 3], "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "nb_col": 5, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 36, "trainable": true, "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 38, 78, 24], "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "nb_col": 5, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_filter": 48, "trainable": true, "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 17, 37, 36], "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "nb_col": 5, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 7, 17, 48], "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 64, "trainable": true, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 5, 15, 64], "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "input_dtype": "float32", "batch_input_shape": [null, 3, 13, 64], "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "input_dim": 2496, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "output_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "input_dim": 100, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "output_dim": 10, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "input_dim": 50, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "W_constraint": null, "bias": true, "input_dim": 10, "activation": "linear"}}]}