{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image6\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 80, 160, 3], "name": "lambda_1", "function_type": "lambda", "output_shape": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_col": 3, "activation": "linear", "init": "normal", "name": "convolution2d_1", "border_mode": "valid", "nb_filter": 24, "trainable": true, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_col": 3, "activation": "linear", "init": "normal", "name": "convolution2d_2", "border_mode": "valid", "nb_filter": 36, "trainable": true, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 39, 79, 24], "input_dtype": "float32", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_col": 3, "activation": "linear", "init": "normal", "name": "convolution2d_3", "border_mode": "valid", "nb_filter": 48, "trainable": true, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 19, 39, 36], "input_dtype": "float32", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_col": 3, "activation": "linear", "init": "normal", "name": "convolution2d_4", "border_mode": "valid", "nb_filter": 64, "trainable": true, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 9, 19, 48], "input_dtype": "float32", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_col": 3, "activation": "linear", "init": "normal", "name": "convolution2d_5", "border_mode": "valid", "nb_filter": 64, "trainable": true, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 7, 17, 64], "input_dtype": "float32", "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 5, 15, 64], "name": "flatten_1", "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "normal", "trainable": true, "bias": true, "input_dim": 4800, "activity_regularizer": null, "b_regularizer": null, "output_dim": 200, "name": "dense_1", "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "normal", "trainable": true, "bias": true, "input_dim": 200, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "name": "dense_2", "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "normal", "trainable": true, "bias": true, "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "name": "dense_3", "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "normal", "trainable": true, "bias": true, "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "name": "dense_4", "W_constraint": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}}}], "keras_version": "1.2.1"}