{"config": [{"config": {"trainable": true, "name": "dropout_1", "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "p": 0.2}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "nb_filter": 24, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "normal", "batch_input_shape": [null, 80, 160, 3], "subsample": [2, 2], "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "nb_filter": 36, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "normal", "batch_input_shape": [null, 38, 78, 24], "subsample": [2, 2], "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_2", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "nb_filter": 48, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "normal", "batch_input_shape": [null, 17, 37, 36], "subsample": [2, 2], "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_3", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "nb_filter": 64, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "normal", "batch_input_shape": [null, 7, 17, 48], "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_4", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "nb_filter": 64, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "normal", "batch_input_shape": [null, 5, 15, 64], "subsample": [1, 1], "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_5", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 3, 13, 64], "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "bias": true, "output_dim": 100, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "normal", "input_dim": 2496, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "bias": true, "output_dim": 50, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "normal", "input_dim": 100, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "bias": true, "output_dim": 10, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "normal", "input_dim": 50, "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "bias": true, "output_dim": 1, "b_constraint": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "init": "normal", "input_dim": 10, "activity_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}