{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "border_mode": "valid", "trainable": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "activation": "linear", "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "border_mode": "valid", "trainable": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 38, 78, 24], "activation": "linear", "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "border_mode": "valid", "trainable": true, "nb_row": 5, "b_regularizer": null, "batch_input_shape": [null, 17, 37, 36], "activation": "linear", "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "border_mode": "valid", "trainable": true, "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 7, 17, 48], "activation": "linear", "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "nb_col": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "border_mode": "valid", "trainable": true, "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 5, 15, 64], "activation": "linear", "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "nb_col": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dim": 2496, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_1"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dim": 100, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_2"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dim": 50, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_3"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dim": 10, "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_4"}}]}