{"keras_version": "1.2.1", "config": [{"config": {"arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image2\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "output_shape_type": "raw", "output_shape": null, "input_dtype": "float32", "trainable": true}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "nb_filter": 24, "activation": "linear", "subsample": [2, 2], "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "bias": true, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "nb_filter": 36, "activation": "linear", "subsample": [2, 2], "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 38, 78, 24], "bias": true, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "nb_filter": 48, "activation": "linear", "subsample": [2, 2], "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 17, 37, 36], "bias": true, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "nb_filter": 64, "activation": "linear", "subsample": [1, 1], "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 7, 17, 48], "bias": true, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"nb_row": 3, "nb_filter": 64, "activation": "linear", "subsample": [1, 1], "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "init": "normal", "border_mode": "valid", "batch_input_shape": [null, 5, 15, 64], "bias": true, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_constraint": null, "input_dim": 2496, "bias": true, "output_dim": 200, "b_regularizer": null, "init": "normal", "name": "dense_1", "trainable": true, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "input_dim": 200, "bias": true, "output_dim": 50, "b_regularizer": null, "init": "normal", "name": "dense_2", "trainable": true, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_constraint": null, "input_dim": 50, "bias": true, "output_dim": 10, "b_regularizer": null, "init": "normal", "name": "dense_3", "trainable": true, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_constraint": null, "input_dim": 10, "bias": true, "output_dim": 1, "b_regularizer": null, "init": "normal", "name": "dense_4", "trainable": true, "b_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}