{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image5\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "trainable": true, "output_shape": null, "batch_input_shape": [null, 80, 160, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "init": "normal", "nb_filter": 24, "name": "convolution2d_1", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "bias": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_col": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "init": "normal", "nb_filter": 36, "name": "convolution2d_2", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 38, 78, 24], "bias": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_col": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "init": "normal", "nb_filter": 48, "name": "convolution2d_3", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 17, 37, 36], "bias": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_col": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "init": "normal", "nb_filter": 64, "name": "convolution2d_4", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 7, 17, 48], "bias": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "init": "normal", "nb_filter": 64, "name": "convolution2d_5", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 5, 15, 64], "bias": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "normal", "name": "dense_1", "input_dim": 2496, "activation": "linear", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "trainable": true, "output_dim": 100, "W_constraint": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "normal", "name": "dense_2", "input_dim": 100, "activation": "linear", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "trainable": true, "output_dim": 50, "W_constraint": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "normal", "name": "dense_3", "input_dim": 50, "activation": "linear", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "trainable": true, "output_dim": 10, "W_constraint": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "normal", "name": "dense_4", "input_dim": 10, "activation": "linear", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activity_regularizer": null, "trainable": true, "output_dim": 1, "W_constraint": null, "bias": true, "b_constraint": null}}], "keras_version": "1.2.1"}