{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "axis": -1, "batch_input_shape": [null, 80, 160, 3], "trainable": true, "name": "batchnormalization_1", "mode": 2, "beta_regularizer": null, "input_dtype": "float32", "gamma_regularizer": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "input_dtype": "float32", "init": "normal", "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "subsample": [2, 2], "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 24}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "input_dtype": "float32", "init": "normal", "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 38, 78, 24], "subsample": [2, 2], "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 36}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "input_dtype": "float32", "init": "normal", "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 17, 37, 36], "subsample": [2, 2], "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 48}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "input_dtype": "float32", "init": "normal", "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 7, 17, 48], "subsample": [1, 1], "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "input_dtype": "float32", "init": "normal", "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 5, 15, 64], "subsample": [1, 1], "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "input_dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 100, "trainable": true, "W_constraint": null, "init": "normal", "name": "dense_1", "b_constraint": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "input_dim": 2496}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 50, "trainable": true, "W_constraint": null, "init": "normal", "name": "dense_2", "b_constraint": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "input_dim": 100}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 10, "trainable": true, "W_constraint": null, "init": "normal", "name": "dense_3", "b_constraint": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "input_dim": 50}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "output_dim": 1, "trainable": true, "W_constraint": null, "init": "normal", "name": "dense_4", "b_constraint": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "b_regularizer": null, "activity_regularizer": null, "input_dim": 10}}]}