{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u001c\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000\u0001|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0001\u00da\u0005print)\u0001\u00da\u0005image\u00a9\u0000r\u0005\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image1\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\n\u0001\u000e\u0001", null, null], "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_filter": 24, "subsample": [2, 2], "bias": true, "nb_col": 5, "activation": "linear", "b_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "normal", "nb_row": 5, "dim_ordering": "tf", "batch_input_shape": [null, 80, 160, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_filter": 36, "subsample": [2, 2], "bias": true, "nb_col": 5, "activation": "linear", "b_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "normal", "nb_row": 5, "dim_ordering": "tf", "batch_input_shape": [null, 38, 78, 24]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_filter": 48, "subsample": [2, 2], "bias": true, "nb_col": 5, "activation": "linear", "b_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "normal", "nb_row": 5, "dim_ordering": "tf", "batch_input_shape": [null, 17, 37, 36]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_filter": 64, "subsample": [1, 1], "bias": true, "nb_col": 3, "activation": "linear", "b_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "normal", "nb_row": 3, "dim_ordering": "tf", "batch_input_shape": [null, 7, 17, 48]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_filter": 64, "subsample": [1, 1], "bias": true, "nb_col": 3, "activation": "linear", "b_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "normal", "nb_row": 3, "dim_ordering": "tf", "batch_input_shape": [null, 5, 15, 64]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "bias": true, "input_dim": 2496, "b_regularizer": null, "W_constraint": null, "init": "normal", "trainable": true, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 50, "bias": true, "input_dim": 100, "b_regularizer": null, "W_constraint": null, "init": "normal", "trainable": true, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "bias": true, "input_dim": 50, "b_regularizer": null, "W_constraint": null, "init": "normal", "trainable": true, "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "input_dim": 10, "b_regularizer": null, "W_constraint": null, "init": "normal", "trainable": true, "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activation": "linear"}}], "keras_version": "1.2.0"}