{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 80, 80, 3], "arguments": {}, "name": "lambda_1", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image6\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 80, 80, 3], "nb_row": 3, "nb_filter": 24, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "input_dtype": "float32", "subsample": [2, 2], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 39, 39, 24], "nb_row": 3, "nb_filter": 36, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "input_dtype": "float32", "subsample": [2, 2], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 19, 19, 48], "nb_row": 3, "nb_filter": 48, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "input_dtype": "float32", "subsample": [2, 2], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 9, 9, 96], "trainable": true, "name": "flatten_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "output_dim": 500, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.00019999999494757503}, "name": "dense_1", "b_regularizer": null, "input_dim": 3888, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "name": "dense_2", "b_regularizer": null, "input_dim": 500, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "name": "dense_3", "b_regularizer": null, "input_dim": 50, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "name": "dense_4", "b_regularizer": null, "input_dim": 10, "bias": true}}]}