{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 80, 160, 3], "trainable": true, "name": "convolution2d_1", "nb_row": 5, "nb_filter": 24}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 38, 78, 24], "trainable": true, "name": "convolution2d_2", "nb_row": 5, "nb_filter": 36}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 17, 37, 36], "trainable": true, "name": "convolution2d_3", "nb_row": 5, "nb_filter": 48}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 7, 17, 48], "trainable": true, "name": "convolution2d_4", "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 5, 15, 64], "trainable": true, "name": "convolution2d_5", "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 3, 13, 64], "trainable": true, "name": "flatten_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 100, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "input_dim": 2496, "trainable": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 50, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "input_dim": 100, "trainable": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 10, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "input_dim": 50, "trainable": true, "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 1, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "input_dim": 10, "trainable": true, "name": "dense_4"}}]}