{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 80, 160, 3], "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "trainable": true, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image5\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "name": "lambda_1", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "name": "convolution2d_1", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 38, 78, 24], "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "name": "convolution2d_2", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "nb_row": 5, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 17, 37, 36], "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "name": "convolution2d_3", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 7, 17, 48], "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "name": "convolution2d_4", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "init": "normal", "input_dtype": "float32", "b_regularizer": null, "batch_input_shape": [null, 5, 15, 64], "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "name": "convolution2d_5", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 3, 13, 64], "input_dtype": "float32", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 0.00019999999494757503, "name": "L1L2Regularizer"}, "output_dim": 200, "b_regularizer": null, "init": "normal", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 2496, "name": "dense_1", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "output_dim": 50, "b_regularizer": null, "init": "normal", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 200, "name": "dense_2", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "output_dim": 10, "b_regularizer": null, "init": "normal", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 50, "name": "dense_3", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "output_dim": 1, "b_regularizer": null, "init": "normal", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 10, "name": "dense_4", "trainable": true}}], "class_name": "Sequential"}