{"config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image6\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 80, 80, 3], "input_dtype": "float32", "arguments": {}, "output_shape": null, "function_type": "lambda", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activity_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "nb_filter": 24, "init": "normal", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "batch_input_shape": [null, 80, 80, 3], "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activity_regularizer": null, "input_dtype": "float32", "name": "convolution2d_2", "nb_filter": 36, "init": "normal", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "batch_input_shape": [null, 39, 39, 24], "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activity_regularizer": null, "input_dtype": "float32", "name": "convolution2d_3", "nb_filter": 48, "init": "normal", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "batch_input_shape": [null, 19, 19, 48], "trainable": true, "border_mode": "valid", "W_constraint": null, "nb_row": 3, "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"input_dtype": "float32", "batch_input_shape": [null, 9, 9, 96], "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0003000000142492354}, "activity_regularizer": null, "output_dim": 500, "activation": "linear", "init": "normal", "bias": true, "trainable": true, "W_constraint": null, "name": "dense_1", "input_dim": 3888}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activity_regularizer": null, "output_dim": 50, "activation": "linear", "init": "normal", "bias": true, "trainable": true, "W_constraint": null, "name": "dense_2", "input_dim": 500}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activity_regularizer": null, "output_dim": 10, "activation": "linear", "init": "normal", "bias": true, "trainable": true, "W_constraint": null, "name": "dense_3", "input_dim": 50}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activity_regularizer": null, "output_dim": 1, "activation": "linear", "init": "normal", "bias": true, "trainable": true, "W_constraint": null, "name": "dense_4", "input_dim": 10}}], "class_name": "Sequential", "keras_version": "1.2.1"}