{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "dim_ordering": "tf", "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "input_dtype": "float32", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 38, 78, 24], "dim_ordering": "tf", "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "input_dtype": "float32", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 17, 37, 36], "dim_ordering": "tf", "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "input_dtype": "float32", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 7, 17, 48], "dim_ordering": "tf", "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "input_dtype": "float32", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 5, 15, 64], "dim_ordering": "tf", "activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "input_dtype": "float32", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 100, "b_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 2496, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 50, "b_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 100, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "output_dim": 10, "b_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 50, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "init": "normal", "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "output_dim": 1, "b_regularizer": null, "bias": true, "b_constraint": null, "input_dim": 10, "W_regularizer": null}}]}