{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "arguments": {}, "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image2\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "batch_input_shape": [null, 80, 160, 3]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_1", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "subsample": [2, 2], "b_constraint": null, "init": "uniform", "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_col": 5, "nb_filter": 24, "input_dtype": "float32", "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_2", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "subsample": [2, 2], "b_constraint": null, "init": "uniform", "batch_input_shape": [null, 38, 78, 24], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_col": 5, "nb_filter": 36, "input_dtype": "float32", "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_3", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "subsample": [2, 2], "b_constraint": null, "init": "uniform", "batch_input_shape": [null, 17, 37, 36], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_col": 5, "nb_filter": 48, "input_dtype": "float32", "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_4", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "subsample": [1, 1], "b_constraint": null, "init": "uniform", "batch_input_shape": [null, 7, 17, 48], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_col": 3, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_5", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "subsample": [1, 1], "b_constraint": null, "init": "uniform", "batch_input_shape": [null, 5, 15, 64], "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_col": 3, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "input_dtype": "float32", "batch_input_shape": [null, 3, 13, 64]}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "output_dim": 100, "W_constraint": null, "trainable": true, "bias": true, "input_dim": 2496, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "output_dim": 50, "W_constraint": null, "trainable": true, "bias": true, "input_dim": 100, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "output_dim": 10, "W_constraint": null, "trainable": true, "bias": true, "input_dim": 50, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "b_constraint": null, "init": "uniform", "activity_regularizer": null, "output_dim": 1, "W_constraint": null, "trainable": true, "bias": true, "input_dim": 10, "b_regularizer": null}}]}