{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image2\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3]}, "class_name": "Lambda"}, {"config": {"trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_1", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "activation": "linear", "batch_input_shape": [null, 80, 160, 3], "subsample": [2, 2], "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "init": "uniform", "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "activation": "linear", "batch_input_shape": [null, 38, 78, 24], "subsample": [2, 2], "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "init": "uniform", "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "nb_col": 5, "input_dtype": "float32", "bias": true, "activation": "linear", "batch_input_shape": [null, 17, 37, 36], "subsample": [2, 2], "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "init": "uniform", "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "name": "convolution2d_4", "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "bias": true, "activation": "linear", "batch_input_shape": [null, 7, 17, 48], "subsample": [1, 1], "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "init": "uniform", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "border_mode": "valid", "nb_col": 3, "input_dtype": "float32", "bias": true, "activation": "linear", "batch_input_shape": [null, 5, 15, 64], "subsample": [1, 1], "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "init": "uniform", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "input_dim": 2496, "bias": true, "output_dim": 100, "activation": "linear", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": 100, "bias": true, "output_dim": 50, "activation": "linear", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "input_dim": 50, "bias": true, "output_dim": 10, "activation": "linear", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "input_dim": 10, "bias": true, "output_dim": 1, "activation": "linear", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "uniform", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}