{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 80, 160, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image5\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "init": "normal", "W_constraint": null, "border_mode": "valid", "input_dtype": "float32", "bias": true, "trainable": true, "batch_input_shape": [null, 80, 160, 3], "b_regularizer": null, "nb_row": 5, "name": "convolution2d_1", "activation": "linear", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "init": "normal", "W_constraint": null, "border_mode": "valid", "input_dtype": "float32", "bias": true, "trainable": true, "batch_input_shape": [null, 38, 78, 24], "b_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "activation": "linear", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "init": "normal", "W_constraint": null, "border_mode": "valid", "input_dtype": "float32", "bias": true, "trainable": true, "batch_input_shape": [null, 17, 37, 36], "b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "activation": "linear", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "init": "normal", "W_constraint": null, "border_mode": "valid", "input_dtype": "float32", "bias": true, "trainable": true, "batch_input_shape": [null, 7, 17, 48], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "activation": "linear", "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "init": "normal", "W_constraint": null, "border_mode": "valid", "input_dtype": "float32", "bias": true, "trainable": true, "batch_input_shape": [null, 5, 15, 64], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "activation": "linear", "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "input_dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "normal", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 2496, "bias": true, "name": "dense_1", "activation": "linear", "output_dim": 200, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "normal", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 200, "bias": true, "name": "dense_2", "activation": "linear", "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "normal", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 50, "bias": true, "name": "dense_3", "activation": "linear", "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "normal", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 10, "bias": true, "name": "dense_4", "activation": "linear", "output_dim": 1, "activity_regularizer": null}}], "keras_version": "1.2.1"}