{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "batch_input_shape": [null, 80, 80, 3], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image1\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "trainable": true, "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 80, 3], "nb_filter": 24, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "input_dtype": "float32", "trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "subsample": [2, 2], "init": "normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 39, 39, 24], "nb_filter": 48, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "input_dtype": "float32", "trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "subsample": [2, 2], "init": "normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 19, 19, 48], "nb_filter": 96, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "input_dtype": "float32", "trainable": true, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "subsample": [2, 2], "init": "normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"input_dtype": "float32", "batch_input_shape": [null, 9, 9, 96], "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 0.0003000000142492354, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_1", "output_dim": 500, "b_regularizer": null, "init": "normal", "W_constraint": null, "input_dim": 7776, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_2", "output_dim": 50, "b_regularizer": null, "init": "normal", "W_constraint": null, "input_dim": 500, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_3", "output_dim": 10, "b_regularizer": null, "init": "normal", "W_constraint": null, "input_dim": 50, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "init": "normal", "W_constraint": null, "input_dim": 10, "trainable": true}}], "keras_version": "1.2.1"}