{"config": [{"config": {"output_shape": null, "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000fnormalize_image2\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\u000e\u0001", null, null], "arguments": {}, "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 80, 160, 3], "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "nb_filter": 24, "dim_ordering": "tf", "init": "normal", "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 38, 78, 24], "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "nb_filter": 36, "dim_ordering": "tf", "init": "normal", "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 17, 37, 36], "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "nb_filter": 48, "dim_ordering": "tf", "init": "normal", "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 7, 17, 48], "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "nb_filter": 64, "dim_ordering": "tf", "init": "normal", "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 5, 15, 64], "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activation": "linear", "name": "convolution2d_5", "nb_filter": 64, "dim_ordering": "tf", "init": "normal", "trainable": true, "border_mode": "valid", "b_constraint": null, "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "nb_row": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "input_dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_1", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "init": "normal", "b_regularizer": null, "b_constraint": null, "output_dim": 200, "activation": "linear", "input_dim": 2496}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_2", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "init": "normal", "b_regularizer": null, "b_constraint": null, "output_dim": 50, "activation": "linear", "input_dim": 200}, "class_name": "Dense"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_3", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "init": "normal", "b_regularizer": null, "b_constraint": null, "output_dim": 10, "activation": "linear", "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_4", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "init": "normal", "b_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear", "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}