{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "nb_col": 5, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "input_dtype": "float32", "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "nb_filter": 24}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "border_mode": "valid", "batch_input_shape": [null, 38, 78, 24], "nb_col": 5, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "input_dtype": "float32", "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "nb_filter": 36}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "border_mode": "valid", "batch_input_shape": [null, 17, 37, 36], "nb_col": 5, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "input_dtype": "float32", "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "nb_filter": 48}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "border_mode": "valid", "batch_input_shape": [null, 7, 17, 48], "nb_col": 3, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "input_dtype": "float32", "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "border_mode": "valid", "batch_input_shape": [null, 5, 15, 64], "nb_col": 3, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "input_dtype": "float32", "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "nb_filter": 64}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 3, 13, 64], "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"input_dim": 2496, "bias": true, "b_constraint": null, "activation": "relu", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 100, "name": "dense_1"}}, {"class_name": "Dense", "config": {"input_dim": 100, "bias": true, "b_constraint": null, "activation": "relu", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 50, "name": "dense_2"}}, {"class_name": "Dense", "config": {"input_dim": 50, "bias": true, "b_constraint": null, "activation": "relu", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 10, "name": "dense_3"}}, {"class_name": "Dense", "config": {"input_dim": 10, "bias": true, "b_constraint": null, "activation": "linear", "init": "normal", "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "name": "dense_4"}}]}