{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "border_mode": "valid", "activity_regularizer": null, "nb_filter": 24, "nb_row": 5, "activation": "linear", "bias": true, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "subsample": [2, 2], "init": "normal", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 38, 78, 24], "border_mode": "valid", "activity_regularizer": null, "nb_filter": 36, "nb_row": 5, "activation": "linear", "bias": true, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "subsample": [2, 2], "init": "normal", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 17, 37, 36], "border_mode": "valid", "activity_regularizer": null, "nb_filter": 48, "nb_row": 5, "activation": "linear", "bias": true, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "nb_col": 5, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "subsample": [2, 2], "init": "normal", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 7, 17, 48], "border_mode": "valid", "activity_regularizer": null, "nb_filter": 64, "nb_row": 3, "activation": "linear", "bias": true, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "subsample": [1, 1], "init": "normal", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 5, 15, 64], "border_mode": "valid", "activity_regularizer": null, "nb_filter": 64, "nb_row": 3, "activation": "linear", "bias": true, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "subsample": [1, 1], "init": "normal", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 3, 13, 64], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "bias": true, "name": "dense_1", "trainable": true, "output_dim": 100, "input_dim": 2496, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "init": "normal", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "bias": true, "name": "dense_2", "trainable": true, "output_dim": 50, "input_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "init": "normal", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "relu", "bias": true, "name": "dense_3", "trainable": true, "output_dim": 10, "input_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "init": "normal", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "name": "dense_4", "trainable": true, "output_dim": 1, "input_dim": 10, "W_regularizer": {"name": "L1L2Regularizer", "l2": 9.999999747378752e-05, "l1": 0.0}, "init": "normal", "activity_regularizer": null}}]}