{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 80, 160, 3], "name": "convolution2d_1", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "bias": true, "nb_col": 5, "border_mode": "valid", "nb_filter": 24, "init": "normal", "b_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 38, 78, 24], "name": "convolution2d_2", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "bias": true, "nb_col": 5, "border_mode": "valid", "nb_filter": 36, "init": "normal", "b_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 17, 37, 36], "name": "convolution2d_3", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "bias": true, "nb_col": 5, "border_mode": "valid", "nb_filter": 48, "init": "normal", "b_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 7, 17, 48], "name": "convolution2d_4", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "bias": true, "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "init": "normal", "b_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 5, 15, 64], "name": "convolution2d_5", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "bias": true, "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "init": "normal", "b_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "batch_input_shape": [null, 3, 13, 64], "name": "flatten_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 100, "name": "dense_1", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "input_dim": 2496, "activation": "relu", "bias": true, "init": "normal", "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 50, "name": "dense_2", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "input_dim": 100, "activation": "relu", "bias": true, "init": "normal", "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 10, "name": "dense_3", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "input_dim": 50, "activation": "relu", "bias": true, "init": "normal", "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "name": "dense_4", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "input_dim": 10, "activation": "linear", "bias": true, "init": "normal", "b_constraint": null}}]}